XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.V2M-MPS2_IOTKit_BSP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4.9" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>https://www.keil.com/pack/</url>
  <name>V2M-MPS2_IOTKit_BSP</name>
  <description>ARM V2M-MPS2 Device Family Pack for IOT-Kit devices</description>

  <releases>
    <release version="1.5.2" date="2024-02-22">
      Reworked Startup:
      - added additional device header include file.
    </release>
    <release version="1.5.1" date="2023-09-04">
      Reworked Board Support:
      - Removed Device.h
      Updated example projects.
    </release>
    <release version="1.5.0" date="2022-01-27">
      Added devices for Arm Virtual Hardware Targets (VHT).
      Removed @version, @date entries from device files.
      Reworked Startup:
      - Added GCC support.
      - Added ARMClang assembler startup.
      - Removed ARMCC5 assembler startup.
      Updated example projects.
    </release>
    <release version="1.4.3" date="2021-04-23">
      Board Support:
      - Updated LED driver.
    </release>
    <release version="1.4.2" date="2019-10-05">
      Fixed device name condition to avoid component conflicts with pack Keil.V2M-MPS3_IOTKit_BSP
    </release>
    <release version="1.4.1" date="2018-07-26">
      Fixed the folder specification for example: IOT-Kit ARMv8MBL Secure/Non-Secure GCC.
    </release>
    <release version="1.4.0" date="2018-06-11">
      Added MTB/ETM targets to ARMv8MBL Secure/Non-Secure example.
      Added GCC support.
      Updated startup files (set MSPLIM).
      Updated use of secure registers.
      Updated SVD files.
    </release>
    <release version="1.3.0" date="2017-03-31">
      Added application notes 300 and 301.
      Added IOTKit_CM23, IOTKit_CM33 Blinky examples.
      Updated SVD files.
      Reworked board support files.
    </release>
    <release version="1.2.0" date="2017-02-08">
      Updated board name to V2M-MPS2 (IoT) to make it unique.
      Disable local processor reset for ARMv8-M devices. Not available for this architecture.
    </release>
    <release version="1.1.0" date="2017-01-12">
      Added device support for IOTKit_CM23, IOTKit_CM33, IOTKit_ARMv8MBL
      - Updated Cortex-M33 IoT Kit Debug Description: Enable Merging of CPU0 System Reset Request and Lock-up Status.
      - Updated ARMv8M Mainline FPU settings in partition*.h
      - Updated ARMv8-M Mainline system file.
      - Updated ARMv8-M core attributes.
      Reworked examples:
      - Updated Cortex-M33 IoT Kit examples: Do not manually set PC and SP, done by RESET.
    </release>
    <release version="1.0.0" date="2016-10-14">
      First Release of V2M-MPS2 Device Family Pack for IOT-Kit devices.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>ARM</keyword>
    <keyword>Device Family Pack for V2M-MPS2</keyword>
    <keyword>IOT-Kit</keyword>
    <keyword>Arm Virtual Hardware Targets</keyword>
    <keyword>VHT</keyword>
  </keywords>

  <devices>
    <!-- ******************************  IOTKit ARMv8-M Baseline *********************** -->
    <family Dfamily="ARMv8-M Baseline" Dvendor="ARM:82">
      <!-- Select JTAG as default protocol -->
      <debugconfig default="jtag" swj="true"/>

      <!--book name="Device/Documents/ARMv8MML_dgug.pdf"       title="ARMv8MML Device Generic Users Guide"/-->
      <description>
IOT-Kit: ARMv8M Baseline Processor based device.
      </description>
      <book name="Documents/Apnt_301.pdf" title ="Using the Cortex-M23 IoT Kit Image on MPS2+"/>

      <memory id="IROM1" start="0x10000000" size="0x00200000" startup="1" default="1"/>
      <memory id="IROM2" start="0x00200000" size="0x00200000" startup="0" default="0"/>
      <memory id="IRAM1" start="0x38000000" size="0x00200000" init   ="0" default="1"/>
      <memory id="IRAM2" start="0x28200000" size="0x00200000" init   ="0" default="0"/>

      <debugvars configfile="Device/IOTKit_ARMv8MBL/Debug/ARMv8MBL.dbgconf">
        // Debug Authentication Variables
        __var DAuthFixed  = 0x1;     // 1 - Use fixed authentication, 0 - Ask for user input
        __var DAuthConfig = 0xF;     // Authentication Value (MPS2 Security Control Block)
        // Bit 0 - Invasive Debug (Hardwired to 1)
        // Bit 1 - Non-Invasive Debug (Hardwired to 1)
        // Bit 2 - Invasive Secure Debug
        // Bit 3 - Non-Invasive Secure Debug
      </debugvars>

      <sequences>
        <!-- Local processor reset not avaialable in ARMv8-M -->
        <sequence name="ResetProcessor" disable="true"/>

        <sequence name="DebugDeviceUnlock">
          <block>
            __var DAuthUserInput  = 0;
            __var DAUTHSTATUS_Val = 0;
            __var DHCSR_Val       = 0;
            __var SecureDebugEna   = 0;
            __var SecureDebugAvail = 0;
            __var DAuthVal         = 0;
            __var SECDBGSTAT_Val   = 0;
            __var SECDBGSET_Val    = 0;
            __var SECDBGCLR_Val    = 0;
            __var RESET_MASK       = 0;

            DAUTHSTATUS_Val  = Read32(0xE000EFB8);
            DHCSR_Val        = Read32(0xE000EDF0);
            SecureDebugAvail = (DAUTHSTATUS_Val &amp; 0x00000020) ? 1 : 0;  // SID: Secure Invasive Debug Implemented

            RESET_MASK  = Read32(0x50021104);
            RESET_MASK |= (1 &lt;&lt; 4) | (1 &lt;&lt; 6);   // RESET_MASK: Enable SYSRESETREQ0_EN and LOCKUP0_EN
            Write32(0x50021104, RESET_MASK);
          </block>

          <control if="SecureDebugAvail" info="Configure Debug Authentication if Security Extensions available">
            <block>
              SecureDebugEna = ((DHCSR_Val &amp; 0x00100000) || ((DAUTHSTATUS_Val &amp; 0x00000030) == 0x00000030)) ? 1 : 0;
            </block>

            <control if="DAuthFixed">
              <block>
                // Debug Authentication as per Debug Configuration File
                DAuthVal = DAuthConfig;
              </block>
            </control>
            <control if="DAuthFixed == 0">
              <block>
                DAuthUserInput = Query(1, "Enable Secure Debug?", 3);
              </block>
              <control if="DAuthUserInput == 3">
                <block>
                  // Enable Secure Debug
                  DAuthVal = 0xF;
                </block>
              </control>
              <control if="DAuthUserInput != 3">
                <block>
                  // Disable Secure Debug
                  DAuthVal = 0x3;
                </block>
              </control>
            </control>

            <control if="SecureDebugEna">
              <block>
                // Read Secure Debug Authentication Status
                SECDBGSTAT_Val = Read32(0x50021000);

                // Assemble SECDBGSET and SECDBGCLR Values
                SECDBGSET_Val  = 0x000000AA;                                // Use internal signals:
                                                                            // DBGEN_SEL_SET   - 1,
                                                                            // NIDEN_SEL_SET   - 1,
                                                                            // SPIDEN_SEL_SET  - 1,
                                                                            // SPNIDEN_SEL_SET - 1

                SECDBGSET_Val |=  DAuthVal &amp; 0x1;                       // DBGEN_I_SET
                SECDBGSET_Val |= (DAuthVal &amp; 0x2) &lt;&lt; 1;           // NIDEN_I_SET
                SECDBGSET_Val |= (DAuthVal &amp; 0x4) &lt;&lt; 2;           // SPIDEN_I_SET
                SECDBGSET_Val |= (DAuthVal &amp; 0x8) &lt;&lt; 3;           // SPNIDEN_I_SET

                SECDBGCLR_Val |=   (DAuthVal ^ 0x1) &amp; 0x1;              // DBGEN_I_SET
                SECDBGCLR_Val |= (((DAuthVal ^ 0x2) &amp; 0x2) &lt;&lt; 1); // NIDEN_I_SET
                SECDBGCLR_Val |= (((DAuthVal ^ 0x4) &amp; 0x4) &lt;&lt; 2); // SPIDEN_I_SET
                SECDBGCLR_Val |= (((DAuthVal ^ 0x8) &amp; 0x8) &lt;&lt; 3); // SPNIDEN_I_SET

                // Write Secure Debug Authentication Set Register
                Write32(0x50021004, SECDBGSET_Val);

