XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.V2M-MPS2_IOTKit_BSP.pdsc
        <!-- device header add on -->
        <file category="header"                         name="Device/Common/Include/SMM_MPS2.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup"                      Cversion="1.2.0" condition="IOTKit_ARMv8MML CMSIS">
      <description>DEPRECATED: System and Startup for ARM IOTKit_ARMv8MML device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="include"                        name="Device/IOTKit_ARMv8MML/Include/"/>
        <file category="include"      condition="VHT"   name="Device/VHT/Include/"/>
        <!-- startup / system file -->
        <file category="sourceAsm"    condition="ARMCC" name="Device/IOTKit_ARMv8MML/Source/ARM/startup_IOTKit_ARMv8MML.S"         version="1.0.0" attr="config"/>
        <file category="linkerScript" condition="ARMCC" name="Device/IOTKit_ARMv8MML/Source/ARM/ac6_arm.sct"                       version="1.0.0" attr="config"/>
        <file category="sourceAsm"    condition="GCC"   name="Device/IOTKit_ARMv8MML/Source/GCC/startup_IOTKit_ARMv8MML.S"         version="1.2.0" attr="config"/>
        <file category="linkerScript" condition="GCC"   name="Device/IOTKit_ARMv8MML/Source/GCC/gcc_arm.ld"                        version="1.2.0" attr="config"/>
        <file category="sourceC"                        name="Device/IOTKit_ARMv8MML/Source/system_IOTKit_ARMv8MML.c"              version="1.2.0" attr="config"/>
        <!-- SAU configuration -->
        <file category="header"                         name="Device/IOTKit_ARMv8MML/Include/Template/partition_IOTKit_ARMv8MML.h" version="1.0.0" attr="config"/>

        <!-- device configuration -->
        <file category="header"                         name="CMSIS/Config/RTE_Device.h"                                           version="1.0.0" attr="config"/>

        <!-- device header add on -->
        <file category="header"                         name="Device/Common/Include/SMM_MPS2.h"/>
      </files>
    </component>

    <!-- IOTKit_CM23 Startup -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="1.2.0" condition="IOTKit_CM23 CMSIS" isDefaultVariant="true">
      <description>System and Startup for ARM IOTKit_CM23 device</description>
      <files>
        <!-- include folder -->
        <file category="include"                        name="Device/IOTKit_CM23/Include/"/>
        <file category="include"      condition="VHT"   name="Device/VHT/Include/"/>
        <!-- startup / system file -->
        <file category="sourceC"                        name="Device/IOTKit_CM23/Source/startup_IOTKit_CM23.c"             version="1.2.0" attr="config"/>
        <file category="linkerScript" condition="ARMCC" name="Device/IOTKit_CM23/Source/ARM/ac6_arm.sct"                   version="1.0.0" attr="config"/>
        <file category="linkerScript" condition="GCC"   name="Device/IOTKit_CM23/Source/GCC/gcc_arm.ld"                    version="1.2.0" attr="config"/>
        <file category="sourceC"                        name="Device/IOTKit_CM23/Source/system_IOTKit_CM23.c"              version="1.2.0" attr="config"/>
        <!-- SAU configuration -->
        <file category="header"                         name="Device/IOTKit_CM23/Include/Template/partition_IOTKit_CM23.h" version="1.0.0" attr="config"/>

        <!-- device configuration -->
        <file category="header"                         name="CMSIS/Config/RTE_Device.h"                                   version="1.0.0" attr="config"/>

        <!-- device header add on -->
        <file category="header"                         name="Device/Common/Include/SMM_MPS2.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup"                      Cversion="1.2.0" condition="IOTKit_CM23 CMSIS">
      <description>DEPRECATED: System and Startup for ARM IOTKit_CM23 device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="include"                        name="Device/IOTKit_CM23/Include/"/>
        <file category="include"      condition="VHT"   name="Device/VHT/Include/"/>
        <!-- startup / system file -->
        <file category="sourceAsm"    condition="ARMCC" name="Device/IOTKit_CM23/Source/ARM/startup_IOTKit_CM23.S"         version="1.0.0" attr="config"/>
        <file category="linkerScript" condition="ARMCC" name="Device/IOTKit_CM23/Source/ARM/ac6_arm.sct"                   version="1.0.0" attr="config"/>
        <file category="sourceAsm"    condition="GCC"   name="Device/IOTKit_CM23/Source/GCC/startup_IOTKit_CM23.S"         version="1.2.0" attr="config"/>
        <file category="linkerScript" condition="GCC"   name="Device/IOTKit_CM23/Source/GCC/gcc_arm.ld"                    version="1.2.0" attr="config"/>
        <file category="sourceC"                        name="Device/IOTKit_CM23/Source/system_IOTKit_CM23.c"              version="1.2.0" attr="config"/>
        <!-- SAU configuration -->
        <file category="header"                         name="Device/IOTKit_CM23/Include/Template/partition_IOTKit_CM23.h" version="1.0.0" attr="config"/>

        <!-- device configuration -->
        <file category="header"                         name="CMSIS/Config/RTE_Device.h"                                   version="1.0.0" attr="config"/>

        <!-- device header add on -->
        <file category="header"                         name="Device/Common/Include/SMM_MPS2.h"/>
      </files>
    </component>

    <!-- IOTKit_CM33 Startup -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="1.2.0" condition="IOTKit_CM33 CMSIS" isDefaultVariant="true">
      <description>System and Startup for ARM IOTKit_CM33 device</description>
      <files>
        <!-- include folder -->
        <file category="include"                        name="Device/IOTKit_CM33/Include/"/>
        <file category="include"      condition="VHT"   name="Device/VHT/Include/"/>
        <!-- startup / system file -->
        <file category="sourceC"                        name="Device/IOTKit_CM33/Source/startup_IOTKit_CM33.c"             version="1.2.0" attr="config"/>
        <file category="linkerScript" condition="ARMCC" name="Device/IOTKit_CM33/Source/ARM/ac6_arm.sct"                   version="1.0.0" attr="config"/>
        <file category="linkerScript" condition="GCC"   name="Device/IOTKit_CM33/Source/GCC/gcc_arm.ld"                    version="1.2.0" attr="config"/>
        <file category="sourceC"                        name="Device/IOTKit_CM33/Source/system_IOTKit_CM33.c"              version="1.2.0" attr="config"/>
        <!-- SAU configuration -->
        <file category="header"                         name="Device/IOTKit_CM33/Include/Template/partition_IOTKit_CM33.h" version="1.0.0" attr="config"/>

        <!-- device configuration -->
        <file category="header"                         name="CMSIS/Config/RTE_Device.h"                                   version="1.0.0" attr="config"/>

