XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.V2M-MPS2_IOTKit_BSP.pdsc
        <!-- device header add on -->
        <file category="header"                         name="Device/Common/Include/SMM_MPS2.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup"                      Cversion="1.2.0" condition="IOTKit_CM33 CMSIS">
      <description>DEPRECATED: System and Startup for ARM IOTKit_CM33 device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="include"                        name="Device/IOTKit_CM33/Include/"/>
        <file category="include"      condition="VHT"   name="Device/VHT/Include/"/>
        <!-- startup / system file -->
        <file category="sourceAsm"    condition="ARMCC" name="Device/IOTKit_CM33/Source/ARM/startup_IOTKit_CM33.S"         version="1.0.0" attr="config"/>
        <file category="linkerScript" condition="ARMCC" name="Device/IOTKit_CM33/Source/ARM/ac6_arm.sct"                   version="1.0.0" attr="config"/>
        <file category="sourceAsm"    condition="GCC"   name="Device/IOTKit_CM33/Source/GCC/startup_IOTKit_CM33.S"         version="1.2.0" attr="config"/>
        <file category="linkerScript" condition="GCC"   name="Device/IOTKit_CM33/Source/GCC/gcc_arm.ld"                    version="1.2.0" attr="config"/>
        <file category="sourceC"                        name="Device/IOTKit_CM33/Source/system_IOTKit_CM33.c"              version="1.2.0" attr="config"/>
        <!-- SAU configuration -->
        <file category="header"                         name="Device/IOTKit_CM33/Include/Template/partition_IOTKit_CM33.h" version="1.0.0" attr="config"/>

        <!-- device configuration -->
        <file category="header"                         name="CMSIS/Config/RTE_Device.h"                                   version="1.0.0" attr="config"/>

        <!-- device header add on -->
        <file category="header"                         name="Device/Common/Include/SMM_MPS2.h"/>
      </files>
    </component>

  </components>

  <boards>
    <board name="V2M-MPS2 (IoT)" vendor="ARM" revision="HPI-0263C" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp">
      <description>ARM Versatile Express Cortex-M Prototyping System Board</description>
      <image small="Boards/ARM/V2M-MPS2/Documents/V2M-MPS2_revB_colour_thumb.png"
             large="Boards/ARM/V2M-MPS2/Documents/V2M-MPS2_revB_colour_medium.png"/>
      <book category="overview" name="http://www.arm.com/products/tools/development-boards/versatile-express/cortex-m-prototyping-system.php" title="Cortex-M Prototyping System (web page)"/>
      <book category="manual"   name="Boards/ARM/V2M-MPS2/Documents/DDI0479C_cortex_m_system_design_kit_r1p0_trm.pdf"                         title="Cortex-M System Design Kit Technical Reference Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="ARM:82" Dname="IOTKit_ARMv8MML"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="IOTKit_ARMv8MBL"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="IOTKit_CM23"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="IOTKit_CM33"/>
      <feature type="XTAL"      n="50000000"/>
      <feature type="PWR"       n="12"             name="12V DC power jack"/>
      <feature type="Batt"      n="1"              name="3V battery"/>
      <feature type="Button"    n="4"              name="Push-buttons: 2 FPGA User, Hardware RESET, ON/OFF soft RESET"/>
      <feature type="ContOther" n="8"              name="Switches: 8 MCC User switches"/>
      <feature type="USB"       n="1"              name="USB 2.0 configuration port"/>
      <feature type="RS232"     n="1"              name="General purpose UART Connector"/>
      <feature type="SPI"       n="1"              name="SPI Header"/>
      <feature type="Other"     n="1"              name="VGA Connector"/>
      <feature type="GLCD"      n="1"  m="240.320" name="2.4 inch QVGA Touchscreen Display"/>
      <feature type="LineIn"    n="1"              name="Stereo line audio IN"/>
      <feature type="LineOut"   n="1"              name="Stereo line audio OUT"/>
      <feature type="ETH"       n="1" m="10000000" name="RJ45 Ethernet Connector"/>
      <feature type="ConnOther" n="1"              name="ARM JTAG 20 Interface"/>
      <feature type="ConnOther" n="1"              name="Cortex Debug (20 Pin) Interface"/>
      <feature type="ConnOther" n="1"              name="Cortex Debug (10 Pin) Interface"/>
      <feature type="ConnOther" n="1"              name="MICTOR 38 Interface"/>

      <debugInterface adapter="JTAG/SW"   connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW"   connector="20 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW"   connector="10 pin Cortex debug (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- V2M-MPS2 Board CMSDK_IOT ARMv8MBL Examples -->
    <!-- Image: AN519 -->
    <example name="IOT-Kit ARMv8MBL Secure/Non-Secure"     doc="README.md" folder="Boards/ARM/V2M-MPS2/IOTKit_ARMv8MBL/IOTKit_ARMv8MBL_S_NS">
      <description>IOT-Kit ARMv8MBL Secure/Non-Secure example</description>
      <board name="V2M-MPS2 (IoT)" vendor="ARM"/>
      <project>
        <environment name="uv" load="IOTKit_ARMv8MBL_s_ns.uvmpw"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="IOT-Kit ARMv8MBL Secure/Non-Secure GCC" doc="README.md" folder="Boards/ARM/V2M-MPS2/IOTKit_ARMv8MBL/IOTKit_ARMv8MBL_S_NS.GCC">
      <description>IOT-Kit ARMv8MBL Secure/Non-Secure example (tool chain GCC)</description>
      <board name="V2M-MPS2 (IoT)" vendor="ARM"/>
      <project>
        <environment name="uv" load="IOTKit_ARMv8MBL_s_ns.uvmpw"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <!-- V2M-MPS2 Board CMSDK_IOT ARMv8MML Examples -->
    <!-- Image: AN505 -->
    <example name="IOT-Kit ARMv8MML Blinky"            doc="README.md" folder="Boards/ARM/V2M-MPS2/IOTKit_ARMv8MML/Blinky">
      <description>IOT-Kit ARMv8MML Blinky example</description>
      <board name="V2M-MPS2 (IoT)" vendor="ARM"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="IOT-Kit ARMv8MML Secure/Non-Secure" doc="README.md" folder="Boards/ARM/V2M-MPS2/IOTKit_ARMv8MML/IOTKit_ARMv8MML_S_NS">
      <description>IOT-Kit ARMv8MML Secure/Non-Secure example</description>
      <board name="V2M-MPS2 (IoT)" vendor="ARM"/>
      <project>
        <environment name="uv" load="IOTKit_ARMv8MML_s_ns.uvmpw"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <!-- V2M-MPS2 Board CMSDK_IOT CM23 Examples -->
    <!-- Image: AN519 -->
    <example name="IOT-Kit CM23 Blinky"            doc="README.md" folder="Boards/ARM/V2M-MPS2/IOTKit_CM23/Blinky">
      <description>IOT-Kit CM23 Blinky example</description>
      <board name="V2M-MPS2 (IoT)" vendor="ARM"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="IOT-Kit CM23 Secure/Non-Secure" doc="README.md" folder="Boards/ARM/V2M-MPS2/IOTKit_CM23/IOTKit_CM23_S_NS">
      <description>IOT-Kit CM23 Secure/Non-Secure example</description>
      <board name="V2M-MPS2 (IoT)" vendor="ARM"/>
      <project>
        <environment name="uv" load="IOTKit_CM23_s_ns.uvmpw"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <!-- V2M-MPS2 Board CMSDK_IOT CM33 Examples -->
    <!-- Image: AN505 -->
    <example name="IOT-Kit CM33 Blinky"            doc="README.md" folder="Boards/ARM/V2M-MPS2/IOTKit_CM33/Blinky">
      <description>IOT-Kit CM33 Blinky example</description>
      <board name="V2M-MPS2 (IoT)" vendor="ARM"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="IOT-Kit CM33 Secure/Non-Secure" doc="README.md" folder="Boards/ARM/V2M-MPS2/IOTKit_CM33/IOTKit_CM33_S_NS">
      <description>IOT-Kit CM33 Secure/Non-Secure example</description>
      <board name="V2M-MPS2 (IoT)" vendor="ARM"/>
      <project>
        <environment name="uv" load="IOTKit_CM33_s_ns.uvmpw"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

  </examples>

</package>
